Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/svd/PIC32CZ2051CA80144.svd
            <register>
               <name>HC2R</name>
               <description>Host Control 2</description>
               <addressOffset>0x3E</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>UHSMS</name>
                     <description>UHS Mode Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>UHSMSSelect</name>
                        <enumeratedValue>
                           <name>SDR12</name>
                           <description>SDR12</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDR25</name>
                           <description>SDR25</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDR50</name>
                           <description>SDR50</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDR104</name>
                           <description>SDR104</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR50</name>
                           <description>DDR50</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VS18EN</name>
                     <description>1.8V Signaling Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VS18ENSelect</name>
                        <enumeratedValue>
                           <name>S33V</name>
                           <description>3.3V Signaling</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>S18V</name>
                           <description>1.8V Signaling</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DRVSEL</name>
                     <description>Driver Strength Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DRVSELSelect</name>
                        <enumeratedValue>
                           <name>B</name>
                           <description>Driver Type B is Selected (Default)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>A</name>
                           <description>Driver Type A is Selected</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>C</name>
                           <description>Driver Type C is Selected</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>D</name>
                           <description>Driver Type D is Selected</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTUN</name>
                     <description>Execute Tuning</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EXTUNSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Not Tuned or Tuning Completed</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REQUESTED</name>
                           <description>Execute Tuning</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLCKSEL</name>
                     <description>Sampling Clock Select</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SLCKSELSelect</name>
                        <enumeratedValue>
                           <name>FIXED</name>
                           <description>Fixed clock is used to sample data</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TUNED</name>
                           <description>Tuned clock is used to sample data</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASINTEN</name>
                     <description>Asynchronous Interrupt Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASINTENSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PVALEN</name>
                     <description>Preset Value Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PVALENSelect</name>
                        <enumeratedValue>
                           <name>HOST</name>
                           <description>SDCLK and Driver Strength are controlled by Host Controller</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTO</name>
                           <description>Automatic Selection by Preset Value is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HC2R_EMMC_MODE</name>
               <description>Host Control 2</description>
               <alternateRegister>HC2R</alternateRegister>
               <addressOffset>0x3E</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>HS200EN</name>
                     <description>HS200 Mode Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>HS200ENSelect</name>
                        <enumeratedValue>
                           <name>SDR12</name>
                           <description>SDR12</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDR25</name>
                           <description>SDR25</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDR50</name>
                           <description>SDR50</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDR104</name>
                           <description>SDR104</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR50</name>
                           <description>DDR50</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DRVSEL</name>
                     <description>Driver Strength Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DRVSELSelect</name>
                        <enumeratedValue>
                           <name>B</name>
                           <description>Driver Type B is Selected (Default)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>A</name>
                           <description>Driver Type A is Selected</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>C</name>
                           <description>Driver Type C is Selected</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>D</name>
                           <description>Driver Type D is Selected</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTUN</name>
                     <description>Execute Tuning</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EXTUNSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Not Tuned or Tuning Completed</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REQUESTED</name>
                           <description>Execute Tuning</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLCKSEL</name>
                     <description>Sampling Clock Select</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SLCKSELSelect</name>
                        <enumeratedValue>
                           <name>FIXED</name>
                           <description>Fixed clock is used to sample data</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TUNED</name>
                           <description>Tuned clock is used to sample data</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PVALEN</name>
                     <description>Preset Value Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PVALENSelect</name>
                        <enumeratedValue>
                           <name>HOST</name>
                           <description>SDCLK and Driver Strength are controlled by Host Controller</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTO</name>
                           <description>Automatic Selection by Preset Value is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
